app/controllers/tasks_controller.rb

SELECT `tasks`.* FROM `tasks` WHERE `tasks`.`status` = 0
---
  def index
    @tasks = Task.where(status: params[:status].presence || 'incomplete')

INSERT INTO `tasks` (`name`, `status`, `created_at`, `updated_at`) VALUES ('aa', 0, '2022-08-10 04:17:58.742211', '2022-08-10 04:17:58.742211')
---
  def create
    @task = Task.new(task_params)
    respond_to do |format|
      if @task.save

UPDATE `tasks` SET `tasks`.`status` = 3, `tasks`.`updated_at` = '2022-08-10 03:29:30.367402' WHERE `tasks`.`id` = 4
---
  def update
    respond_to do |format|
      if @task.update(task_params)

DELETE FROM `tasks` WHERE `tasks`.`id` = 2
---
  def destroy
    @task.destroy

UPDATE `tasks` SET `tasks`.`status` = 1, `tasks`.`updated_at` = '2022-08-10 04:27:30.269064' WHERE `tasks`.`id` = 1
---
  def change_status
    @task.update(status: task_params[:status])

SELECT `tasks`.* FROM `tasks` WHERE `tasks`.`id` = 1 LIMIT 1
---
    def set_task
      @task = Task.find(params[:id])